#+TITLE: Variable-Density Mixing Layer Entrainment
#+AUTHOR: Paul Bartholomew

#+OPTIONS: toc:nil

#+LATEX_HEADER: \usepackage{fullpage}
#+LATEX_HEADER: \usepackage{nicefrac}
#+LATEX_HEADER: \hypersetup{colorlinks}

# #+BEGIN_ABSTRACT
# This document documents the investigation of entrainment in variable-density flows using a 3D mixing
# layer as a model of a jet.
# #+END_ABSTRACT

*** Domain and Mesh

The domain is of dimensions @@latex:$461\times368\times173$@@ and is meshed with @@latex:$1536\times851\times576$@@ mesh
nodes.
The reference vertical resolution in the region @@latex:$\left|y\right|\leq20$@@ is @@latex:$\Delta{}y=0.2$@@
and is stretched at @@latex:$1\%$@@ out to @@latex:$\left|y\right|<150$@@ where @@latex:$\Delta{}y=0.85$@@,
the resolution is then increased again towards the walls with stretching @@latex:$3\%$@@ to give
@@latex:$\Delta{}y=0.3$@@ at the walls.
Incompact3D cannot do this stretching/unstretching as far as I know - therefore best approach is
probably to try and have the average resolutions match in the inner (@@latex:$\left|y\right|\leq20$@@)
and outer layers.
The resolution in @@latex:$x$@@ and @@latex:$z$@@ is constant.

#+CAPTION: Code to specify the domain
#+NAME: src:domain.prm
#+BEGIN_SRC text
  461.0    #xlx  # Lx (Size of the box in x-direction)
  368.0    #yly  # Ly (Size of the box in y-direction) 
  173.0    #zlz  # Lz (Size of the box in z-direction) 
#+END_SRC

For mesh convergence, several meshes will be considered as given in table [[tab:mesh-codes]]

#+NAME: tab:mesh-codes
#+CAPTION: Mesh sizes
|------+----------------+----------------+----------------+------------------|
| Mesh | @@latex:$N_x$@@ | @@latex:$N_y$@@ | @@latex:$N_z$@@ | @@latex:$N_{tot}$@@ |
|------+----------------+----------------+----------------+------------------|
| m1   |             32 |             33 |             16 |            16896 |
| m2   |             64 |             65 |             32 |           133120 |
| m3   |            128 |            129 |             64 |          1056768 |
| m4   |            256 |            257 |            128 |          8421376 |
| m5   |            512 |            513 |            256 |         67239936 |
| m6   |           1024 |           1025 |            512 |        537395200 |
|------+----------------+----------------+----------------+------------------|
#+TBLFM: $5=$2*$3*$4

The mesh can be stretched by the following code:
#+CAPTION: Mesh stretching
#+NAME: src:mesh-stretch.prm
#+BEGIN_SRC text
  0      #istret # y mesh refinement (0:no, 1:center, 2:both sides, 3:bottom)
  0.3    #beta   # Refinement parameter (beta)
#+END_SRC

The code to specify the mesh for each case is given as

